app/views/home/index.html.erb


	<% todos = Publication.all%>
---
SELECT "publications".* FROM "publications"