app/controllers/home_controller.rb

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "publications" SET "like" = ?, "updated_at" = ? WHERE "publications"."id" = ?  [["like", 1], ["updated_at", "2018-12-01 02:16:54.624750"], ["id", 2]]
---
  def curtir
  	id = params[:id]
  	publicacao = Publication.find id
  	publicacao.update(like: publicacao.like+1)

INSERT INTO "publications" ("legenda", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["legenda", "tem que da certo agora :´("], ["like", 0], ["created_at", "2018-12-02 04:29:09.996524"], ["updated_at", "2018-12-02 04:29:09.996524"]]
---
  def create
    legenda = params[:legenda]
  	publicacao = Publication.create legenda:legenda, like:0

DELETE FROM "publications" WHERE "publications"."id" = ?  [["id", 4]]
---
  def apagar
  	id = params[:id]
  	Publication.destroy id